Catalogs/питМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питМеню</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рецептура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.питРецептура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВГруппе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветФонаКнопок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MRS_КодSimphony</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MRS_СтатусСинхронизацииSimphony</Name>
					<Type>
						<v8:Type>cfg:EnumRef.MRS_СтатусыСинхронизацииSimphony</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/питМеню/Forms/MФормаСписка/Ext/Form/Module.bsl
// Модуль формы списка справочника

Перем СпособРасчетаРецептур;  			// Способ подбора основной рецептуры для блюда.

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке)
	
	Результат = ИнформацияОбОшибке;
	Если ИнформацияОбОшибке <> Неопределено Тогда
		Если ИнформацияОбОшибке.Причина <> Неопределено Тогда
			Результат = ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке.Причина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДействиеПодбор(ТабличноеПоле)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	МассивТиповНоменклатуры = Новый Массив();
	МассивТиповНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
	ДоступныеТипыНоменклатуры = Новый ФиксированныйМассив(МассивТиповНоменклатуры);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ТипНоменклатуры", ДоступныеТипыНоменклатуры));
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", 
			ПараметрыФормы, 
			ЭтаФорма, 
			УникальныйИдентификатор,,,, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ДействиеПодбор(Список);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ПараметрыФормы = Новый Структура("ВидПрайсЛиста", ОтборВладелец);
	ОткрытьФорму("Справочник.питМеню.Форма.ФормаВыгрузки",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованияПозиций(Команда)
	// Меняем наименование элементов меню на наименование номенклатуры.
	// Группы не трогаем.
	МассивОшибок = Новый Массив;
	ОбновитьНаименования(Ложь,МассивОшибок);
	Если МассивОшибок.Количество() > 0 Тогда
		ТекстОшибки = "";
		Статус = Неопределено;
		Для Каждого Ошибка Из МассивОшибок Цикл
			Ошибка.Свойство("Текст",ТекстОшибки);
			Ошибка.Свойство("Статус",Статус);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект), "Удалить все позиции из меню?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Возврат; 
	КонецЕсли;
	
	ОчиститьСервер();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСервер()
	ВладелецПрайсЛиста = ПолучитьТекущегоВладельца();
	Справочники.питМеню.ОчиститьПрайсЛист(ВладелецПрайсЛиста)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	питИзменениеОтраслевыхФормСервер.ПриСозданииНаСервереВНачале(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		ОтборВладелец = Параметры.Отбор.Владелец;
		Элементы.СтраницыОтборВидПрайсЛиста.ТекущаяСтраница = Элементы.ГруппаОтображениеВидПрайсЛиста;
		Параметры.Отбор.Удалить("Владелец");
	Иначе
		Если ОтборВладелец.Пустая() Тогда
			ОтборВладелец = Справочники.питВидыМеню.ОсновнойВидМеню;
		КонецЕсли;
		Элементы.СтраницыОтборВидПрайсЛиста.ТекущаяСтраница = Элементы.ГруппаОтборВидПрайсЛиста;
	КонецЕсли;
	ОтборВладелецИспользование = ЗначениеЗаполнено(ОтборВладелец);
	питОбщегоНазначенияКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Владелец");
	
	Если ТолькоПросмотр Тогда
		Элементы.ФормаПодбор.Доступность    = Ложь;
		Элементы.ФормаУдалить.Доступность   = Ложь;
		Элементы.ФормаОчистить.Доступность	= Ложь;
		Элементы.ФормаЗаполнить.Доступность = Ложь;
		Элементы.ФормаВыгрузить.Доступность = Ложь;
		Элементы.ФормаОбновитьВсеГруппы.Доступность            = Ложь;
		Элементы.ФормаЗаполнитьНаименованияПозиций.Доступность = Ложь;
		Элементы.ФормаЗаполнитьНаименованияГрупп.Доступность   = Ложь;
		Элементы.ФормаСкопироватьСтруктуруГрупп.Доступность    = Ложь;
		Элементы.ФормаЗаполнитьПоВыпускам.Доступность          = Ложь;
	КонецЕсли;
	
	УправлениеДиалогом(ЭтаФорма);
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	//СпособРасчетаРецептур							= Константы.питСпособРасчетаРецептур.Получить();	
	СпособРасчетаРецептур	= питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СпособРасчетаРецептур");
	СпособРасчетаРецептурВВыпускеПродукции			= Константы.питСпособРасчетаРецептур.Получить();
	// Определим видимость колонки ссылочной рецептуры.
	Если СпособРасчетаРецептурВВыпускеПродукции=Перечисления.питСпособРасчетаРецептур.ПоАктуальнойРецептуре Тогда
		Элементы.Список.ПодчиненныеЭлементы.Рецептура.Видимость			= Ложь;
	Иначе
		Элементы.Список.ПодчиненныеЭлементы.Рецептура.Видимость			= Истина;
	КонецЕсли;
	Элементы.Список.ПодчиненныеЭлементы.Владелец.Видимость	= Ложь;
	Элементы.Список.ПодчиненныеЭлементы.Код.Видимость		= Ложь;
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.питМеню);
	Элементы.КоманднаяПанельФормы.Видимость				= МожноРедактировать;
	Элементы.СписокКонтекстноеМенюУдалитьМеню.Видимость	= МожноРедактировать;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Инициализируем текущего родителя дерева
	ТекущийРодительДерева = Неопределено;
	
	// Отображаем дерево групп
	ОтображатьДерево(Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Управляет видимостью и доступностью элементов формы.
Процедура УправлениеДиалогом(Форма)
	Элементы = Форма.Элементы;
	Доступно = ВладелецУстановлен(Форма);    
	Элементы.ФормаОчистить.Доступность	= Доступно;
	Элементы.ФормаВыгрузить.Доступность	= Доступно;

КонецПроцедуры // УправлениеДиалогом()

&НаКлиенте
Процедура ОтображатьДерево(Команда)
	//Элементы.ФормаОтображатьДерево.Пометка		= Не Элементы.ФормаОтображатьДерево.Пометка; // Инвертируем флаг
	//Элементы.Дерево.Видимость = Ложь;
	Элементы.Дерево.Видимость = Истина;
	Если НЕ Элементы.Дерево.Видимость Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Родитель")
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Позиционируемся на введенный объект, если он доступен в списке
	Попытка
		ЭтаФорма.Элементы.Список.ТекущаяСтрока = НовыйОбъект.Ссылка;
	Исключение
		// Объект может быть недоступен в текущем отборе списка - игнорируем ошибку
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеЗначенийСвойств" И Источник = Элементы.Список.ТекущаяСтрока Тогда
		//РаботаСДиалогами.ИзменитьПредставлениеКнопкиВыбораСвойств(ЭтаФорма, Параметр);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоВладельца()
	ВладелецОтбор = питОбщегоНазначенияКлиентСервер.ЭлементОтбораСпискаПоИмени(Список, "Владелец");
	Если ВладелецОтбор <> Неопределено Тогда
		ВладелецОтбор = ВладелецОтбор.ПравоеЗначение;
	Иначе
		ВладелецОтбор = Справочники.питВидыМеню.ПустаяСсылка()
	КонецЕсли;
	Возврат ВладелецОтбор
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВладелецУстановлен(Форма)
	ВладелецОтбор = питОбщегоНазначенияКлиентСервер.ЭлементОтбораСпискаПоИмени(Форма.Список, "Владелец");
	Если ВладелецОтбор <> Неопределено Тогда
		ЗначениеОтбораВладелец = ?(ВладелецОтбор = Неопределено, Форма.ВидПрайсЛистаПустаяСсылка, ВладелецОтбор.ПравоеЗначение);
		ИспользованиеОтбораВладелец = ?(ВладелецОтбор = Неопределено, Ложь, ВладелецОтбор.Использование);
		
		Доступно = ЗначениеЗаполнено(ЗначениеОтбораВладелец) И ИспользованиеОтбораВладелец;
	Иначе
		Доступно = Ложь;
	КонецЕсли;
	
	Возврат Доступно;
КонецФункции

&НаСервере
Процедура ОбновитьНаименования(ДляГрупп = Ложь, МассивОшибок = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Меню.Ссылка КАК МенюСсылка,
	|	Меню.Номенклатура.Ссылка КАК НомСсылка,
	|	Меню.Родитель,
	|	Меню.ЭтоГруппа,
	|	Меню.Наименование КАК МенюНаименование,
	|	Меню.Номенклатура.Наименование КАК НомНаименование,
	|	Меню.НомерВГруппе
	|ИЗ
	|	Справочник.питМеню КАК Меню
	|ГДЕ
	|	"+?(ДляГрупп,"","Не ")+"Меню.ЭтоГруппа
	|	И НЕ Меню.Наименование = Меню.Номенклатура.Наименование
	|	И Меню.Владелец = &Владелец
	|УПОРЯДОЧИТЬ ПО
	|	Меню.НомерВГруппе";
	Запрос.УстановитьПараметр("ДляГрупп", ДляГрупп);
	Запрос.УстановитьПараметр("Владелец", ПолучитьТекущегоВладельца());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Статус					= СтатусСообщения.Информация;
		МенюСсылка				= Выборка.МенюСсылка;
		МенюОбъект				= МенюСсылка.ПолучитьОбъект();
		МенюОбъект.Наименование	= Выборка.НомНаименование;
		
		Попытка
			МенюОбъект.Записать();
			Действие	= " изменилось на ";
		Исключение
			Действие	= " ошибка записи: " + ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке()).Описание;
			Статус		= СтатусСообщения.Внимание;
		КонецПопытки;
		Если Статус = СтатусСообщения.Информация Тогда
			Действие	= Действие + "<" + МенюСсылка.Наименование + ">";
		КонецЕсли;
		СтруктураОшибок = Новый Структура;
		СтруктураОшибок.Вставить("Текст","Наименование " + "<" + Выборка.МенюНаименование + ">" + Действие);
		СтруктураОшибок.Вставить("Статус", Статус);
		МассивОшибок.Добавить(СтруктураОшибок);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьНомер(Команда)
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	Ошибки = "";
	УменьшитьНомерНаСервере(ТекСтрока, Ошибки);
	Если Ошибки <> "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись меню """+ТекСтрока+""": "+Ошибки);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УменьшитьНомерНаСервере(ПрайсЛист, Ошибки = "")
	ТекНомерВГруппе	= ПрайсЛист.НомерВГруппе;
	Если ТекНомерВГруппе <=1 Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Меню.Ссылка,
	|	Меню.НомерВГруппе КАК НомерВГруппе
	|ИЗ
	|	Справочник.питМеню КАК Меню
	|ГДЕ
	|	Меню.Владелец = &ВидМеню
	|	И (Меню.НомерВГруппе < &НомерВГруппе ИЛИ (Меню.НомерВГруппе = &НомерВГруппе И Меню.Ссылка < &Ссылка))
	|	И Меню.Родитель =  &ТекРодитель
	|УПОРЯДОЧИТЬ ПО
	|	НомерВГруппе УБЫВ";
	Запрос.УстановитьПараметр("ВидМеню",ПолучитьТекущегоВладельца());
	Запрос.УстановитьПараметр("НомерВГруппе",ТекНомерВГруппе);
	Запрос.УстановитьПараметр("ТекРодитель",ПрайсЛист.Родитель);
	Запрос.УстановитьПараметр("Ссылка",ПрайсЛист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Запомним первый больший приоритет
		ПервыйНомерВГруппе = Выборка.НомерВГруппе;
		Если ПервыйНомерВГруппе = ТекНомерВГруппе Тогда
			ПервыйНомерВГруппе = ПервыйНомерВГруппе - 1;
		Иначе
			ОбъектМеню = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектМеню.НомерВГруппе = ПервыйНомерВГруппе + 1;
			ОбъектМеню.ДополнительныеСвойства.Вставить("СменаНомера",Истина);
			Попытка
				ОбъектМеню.Записать();
			Исключение
				Ошибки = Ошибки + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ОбъектМеню);
			КонецПопытки;
		КонецЕсли;
		
		ОбъектМеню = ПрайсЛист.ПолучитьОбъект();
		ОбъектМеню.НомерВГруппе = ПервыйНомерВГруппе;
		ОбъектМеню.ДополнительныеСвойства.Вставить("СменаНомера",Истина);
		Попытка
			ОбъектМеню.Записать();
		Исключение
			Ошибки = Ошибки + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ОбъектМеню);
		КонецПопытки;
		
	КонецЕсли;	
	
	// Возможно дублирование номеров, если есть повторение, то сдвинем их в другую сторону.
	Пока Выборка.Следующий() И (ПервыйНомерВГруппе <= Выборка.НомерВГруппе) И (Выборка.НомерВГруппе > 0) Цикл
		
		Если ПервыйНомерВГруппе > 1 Тогда
			ПервыйНомерВГруппе = ПервыйНомерВГруппе - 1 ;
		КонецЕсли;
		
		ОбъектМеню = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектМеню.НомерВГруппе = ПервыйНомерВГруппе;
		ОбъектМеню.ДополнительныеСвойства.Вставить("СменаНомера",Истина);
		Попытка
			ОбъектМеню.Записать();
		Исключение
			Ошибки = Ошибки + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ОбъектМеню);
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьНомер(Команда)
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ошибки = "";
	УвеличитьНомерНаСервере(ТекСтрока, Ошибки);
	Если Ошибки <> "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись меню """+ТекСтрока+""": "+Ошибки);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УвеличитьНомерНаСервере(ПрайсЛист,Ошибки = "")
	ТекНомерВГруппе	= ПрайсЛист.НомерВГруппе;	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Меню.Ссылка,
	|	Меню.НомерВГруппе КАК НомерВГруппе
	|ИЗ
	|	Справочник.питМеню КАК Меню
	|ГДЕ
	|	Меню.Владелец = &ВидМеню
	|	И (Меню.НомерВГруппе > &НомерВГруппе ИЛИ (Меню.НомерВГруппе = &НомерВГруппе И Меню.Ссылка > &Ссылка))
	|   И Меню.Родитель =  &ТекРодитель
	|УПОРЯДОЧИТЬ ПО
	|	НомерВГруппе";
	Запрос.УстановитьПараметр("ВидМеню",ПолучитьТекущегоВладельца());
	Запрос.УстановитьПараметр("НомерВГруппе",ТекНомерВГруппе);
	Запрос.УстановитьПараметр("ТекРодитель",ПрайсЛист.Родитель);
	Запрос.УстановитьПараметр("Ссылка",ПрайсЛист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Запомним первый минимальный приоритет
		ПервыйНомерВГруппе = Выборка.НомерВГруппе;
		Если ПервыйНомерВГруппе = ТекНомерВГруппе Тогда
			ПервыйНомерВГруппе = ПервыйНомерВГруппе + 1;
		Иначе
			ОбъектМеню = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектМеню.НомерВГруппе = ПервыйНомерВГруппе - 1;
			ОбъектМеню.ДополнительныеСвойства.Вставить("СменаНомера",Истина);
			Попытка
				ОбъектМеню.Записать();
			Исключение
				Ошибки = Ошибки + ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;
		
		ОбъектМеню = ПрайсЛист.ПолучитьОбъект();
		ОбъектМеню.НомерВГруппе = ПервыйНомерВГруппе;
		ОбъектМеню.ДополнительныеСвойства.Вставить("СменаНомера",Истина);
		Попытка
			ОбъектМеню.Записать();
		Исключение
			Ошибки = Ошибки + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;
	
	// Возможно дублирование номеров, если есть повторение, то сдвинем их в другую сторону.
	Пока Выборка.Следующий() И (ПервыйНомерВГруппе >= Выборка.НомерВГруппе) Цикл
		
		ПервыйНомерВГруппе = ПервыйНомерВГруппе + 1 ;
		
		ОбъектМеню = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектМеню.НомерВГруппе = ПервыйНомерВГруппе;
		ОбъектМеню.ДополнительныеСвойства.Вставить("СменаНомера",Истина);
		Попытка
			ОбъектМеню.Записать();
		Исключение
			Ошибки = Ошибки + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидПрайсЛистаИспользованиеПриИзменении(Элемент)
	
	питОбщегоНазначенияКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Владелец");
	УправлениеДиалогом(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидПрайсЛистаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборВладелец) Тогда
		ОтборВладелецИспользование = Истина;
	КонецЕсли;
	
	питОбщегоНазначенияКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Владелец");
	
	УправлениеДиалогом(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМеню(Команда)
	текСтрока = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(текСтрока) Тогда
		УдалитьМенюСервер(текСтрока);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьМенюСервер(Меню)
	МенюОбъект = Меню.ПолучитьОбъект();
	МенюОбъект.ОбменДанными.Загрузка = Истина; //?? временно, исправление ошибки удаления элемента меню с правами Бухгалтера.
	// Из-за вот этого(↑↑↑↑↑↑↑)флага, при удалении объекта,
	// если это группа, то платформа не производит удаление дочерних,
	// поэтому остаются битые ссылки.
	// Ищем все дочерние элементы с учетом иерархии, для того, чтобы и их тоже удалить.
	МассивДочерних = Новый Массив;
	Если МенюОбъект.ОбменДанными.Загрузка И МенюОбъект.ЭтоГруппа Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	питМеню.Ссылка
		|ИЗ
		|	Справочник.питМеню КАК питМеню
		|ГДЕ
		|	питМеню.Родитель В ИЕРАРХИИ(&Родитель)";
		Запрос.УстановитьПараметр("Родитель", Меню);
		МассивДочерних = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Попытка
		Если МенюОбъект.ОбменДанными.Загрузка Тогда
			// Удаление дочерних вручную
			Для каждого ТекДочернийЭлемент Из МассивДочерних Цикл
				ТекДочернийОбъект = ТекДочернийЭлемент.ПолучитьОбъект();
				ТекДочернийОбъект.ОбменДанными.Загрузка = Истина; //?? временно, исправление ошибки удаления элемента меню с правами Бухгалтера.
				ТекДочернийОбъект.Удалить();
			КонецЦикла;
		КонецЕсли;
		// Удаление непосредственно элемента меню
		МенюОбъект.Удалить();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
&НаКлиенте
Процедура Создать(Команда)
	 // Формируем параметры для открытия формы
  ПараметрыФормы = Новый Структура;
  // Передаём обработчик закрытия
  Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормы", ЭтаФорма);

  // Передаем владельца, если он установлен
  Если ЗначениеЗаполнено(ОтборВладелец) Тогда
    
    ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец, Родитель", ОтборВладелец, Элементы.Дерево.ТекущаяСтрока));
	    
  КонецЕсли;
  	
  // Открываем форму элемента
  ОткрытьФорму("Справочник.питМеню.Форма.МФормаЭлемента", ПараметрыФормы, ЭтаФорма,,,,Оповещение);
  
  КонецПроцедуры 
  
&НаКлиенте
Процедура ПослеЗакрытияФормы(Результат, ДопПараметры) Экспорт
    // Обновляем список, если запись прошла
    Если Результат = Истина Тогда
        Элементы.Список.Обновить();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	
  // Формируем параметры для открытия формы
  ПараметрыФормы = Новый Структура;
  
  // Передаем владельца, если он установлен
  Если ЗначениеЗаполнено(ОтборВладелец) Тогда
    
    ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", ОтборВладелец));
    ПараметрыФормы.Вставить("ЭтоГруппа", Истина);

  КонецЕсли;
  
    
  // Открываем форму группы
  ОткрытьФорму("Справочник.питМеню.Форма.ФормаГруппы", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, изменился ли родитель - если нет, не делаем ничего
	Если ТекущийРодительДерева = ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	// Сохраняем текущего родителя
	ТекущийРодительДерева = ТекущаяСтрока;
	
	// Устанавливаем отбор списка по выбранной группе
	ИспользоватьОтбор = ЗначениеЗаполнено(ТекущаяСтрока);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Родитель", ТекущаяСтрока, ИспользоватьОтбор);
	
	// Сохраняем текущего родителя для создания новых элементов
	Элементы.Список.ТекущийРодитель = ТекущаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦены(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
